gauya/bluepill_cube/lib/stm32/src/gadc.cpp
// multi, continues, use dma
#if defined(STM32F4) || defined(STM32F7)
  _ha->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  _ha->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  _ha->Init.Resolution = ADC_RESOLUTION_12B;
  _ha->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  if( _mode == eADC_DMA || _mode == eADC_DMAINTERRUPT ) {
    _ha->Init.DMAContinuousRequests = ENABLE;
  } else {
    _ha->Init.DMAContinuousRequests = DISABLE;
  }
#endif //STM32F4

  if (HAL_ADC_Init(_ha) != HAL_OK) {// --> call HAL_ADC_MspInit()
      ERROR_OCR(""); //Error_Handler();
  }

  _chs = ac;

  for(int i=0; i < _ha->Init.NbrOfConversion; i++) {
    add_channel(ac+i);
  }

  if( !_dmabuf ) {
    _dmabuf = new uint16_t[channel_num()*2];
  }
#if 1  // F1

    __HAL_RCC_DMA1_CLK_ENABLE();

    HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);

    _hd->Instance = DMA1_Channel1;
    _hd->Init.Direction = DMA_PERIPH_TO_MEMORY;
    _hd->Init.PeriphInc = DMA_PINC_DISABLE;
    _hd->Init.MemInc = DMA_MINC_ENABLE;
    _hd->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    _hd->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    _hd->Init.Mode = DMA_CIRCULAR;
    _hd->Init.Priority = DMA_PRIORITY_LOW;
    if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
    {
      ERROR_OCR(""); //Error_Handler();
    }

#else  // F4
  __HAL_RCC_DMA2_CLK_ENABLE();
  HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);

  _hd->Instance = DMA2_Stream0;
  _hd->Init.Channel = DMA_CHANNEL_0;
  _hd->Init.Direction = DMA_PERIPH_TO_MEMORY;
  _hd->Init.PeriphInc = DMA_PINC_DISABLE;
  _hd->Init.MemInc = DMA_MINC_ENABLE;
  _hd->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  _hd->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  _hd->Init.Mode = DMA_CIRCULAR;
  _hd->Init.Priority = DMA_PRIORITY_MEDIUM; //DMA_PRIORITY_LOW;
  _hd->Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
  {
    ERROR_OCR(""); //Error_Handler();
  }

  hdma_adcp = &hdma_adc1;

#endif  

  __HAL_LINKDMA((_ha),DMA_Handle,hdma_adc1);

  HUL_ADC_nvic(adc, 1);

  if(HAL_ADC_Start_DMA(_ha, (uint32_t*)_dmabuf, channel_num()) != HAL_OK) {
    ERROR_OCR("adc start dma nok"); //Error_Handler();
  }

  _status = 0;
}

int gadc::add_channel(uint32_t ch,uint32_t samplerate) {
  ADC_ChannelConfTypeDef sConfig = {0};
  sConfig.Channel = ch;
  sConfig.SamplingTime = samplerate; // default ADC_SAMPLETIME_84CYCLES; 
  sConfig.Rank = ++_channel_num; // 1 ~ ,  

  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_OCR("add adc channel"); //Error_Handler();
  }

  return  _channel_num; // rank is auto increase sequentially
}

int gadc::add_channel(struct adc_channels *ac) {
  ADC_ChannelConfTypeDef sConfig = {0};
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  
  sConfig.Channel = ac->ch;
  sConfig.Rank = ac->rank = _channel_num; // 0~ order by
  sConfig.SamplingTime = ac->sampling; //ADC_SAMPLETIME_3CYCLES;
  
  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_OCR("add adc channel"); //Error_Handler();
  }

  if( ac->port != 0 ) { // not Vrefint, temperture, ..
    // ---> HUL_GPIO_CLK_Enable(ac->port)
    if( IS_GPIO_ALL_INSTANCE(ac->port)) {
      if( IS_GPIO_ALL_INSTANCE(GPIOA) && (ac->port == GPIOA) ) { __HAL_RCC_GPIOA_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOB) && (ac->port == GPIOB )) { __HAL_RCC_GPIOB_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOC) && (ac->port == GPIOC )) { __HAL_RCC_GPIOC_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOD) && (ac->port == GPIOD )) { __HAL_RCC_GPIOD_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOE) && (ac->port == GPIOE )) { __HAL_RCC_GPIOE_CLK_ENABLE(); }
//      else if( IS_GPIO_ALL_INSTANCE(GPIOH) && (ac->port == GPIOH )) { __HAL_RCC_GPIOH_CLK_ENABLE(); }
    } else {
      _status |= 4;
      return -1;
    }

    GPIO_InitStruct.Pin = (1 << (ac->pin)); //GPIO_PIN_n;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL; //GPIO_PULLDOWN; //GPIO_NOPULL;
    HAL_GPIO_Init(ac->port, &GPIO_InitStruct);
  }

  return ++_channel_num;
}

int gadc::start() {
  if(HAL_ADC_Start(_ha) != HAL_OK) {
    return 0;
  }
  return -1;
}

int gadc::stop() {
  if(HAL_ADC_Stop(_ha) != HAL_OK) {
    return 0;
  }
  return -1;
}

int gadc::read() {
  if( ! isready() ) { 
    return (-1);
  }
#if 0
  _converted = 0;
  HAL_ADC_Start(_ha);

  while( _converted == 0 ) {
    delay_us(_timeout);
  };
#endif
}

int gadc::read(uint16_t *buf) {

  int i = 0;
  for(; i < _channel_num; i++ ) {
    if(HAL_ADC_PollForConversion(_ha, 1) != HAL_OK) {
    ERROR_OCR(""); //Error_Handler();
    }
    
    uint32_t v = HAL_ADC_GetValue(_ha);  // get adc value
    buf[i] = (uint16_t)(v & 0x0fffU);
  }

  stop();

  return i;
}
// -----------------------------------------------------------------------------------------------

#if 0
void HAL_DMA_TransferCpltCallback(DMA_HandleTypeDef *hdma) {
  // 버퍼 처리 (예: 데이터 분석, 전송 등)
  dma_finish1++;
}

void HAL_DMA_StreamTransferCpltCallback(DMA_HandleTypeDef *hdma) {
  // DMA 재시작 (연속 읽어오기)

  HAL_DMA_Start_IT(hdma, (uint32_t)&ADC1->DR, (uint32_t)adc_buffer, 7);
}
#endif

#if 0
int adc_completed = 0;
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
  adc_completed++;

  if( _stm32adc_callback  ) {
    _stm32adc_callback();
  }


  adc_data[0] = HAL_ADC_GetValue(hadc, ADC_CHANNEL_1);
  adc_data[1] = HAL_ADC_GetValue(hadc, ADC_CHANNEL_2);
  ...


  HAL_ADC_Start_IT(hadc);
}
#endif

#ifdef __cplusplus
}
#endif

stm32adc::stm32adc() { //LSE_STARTUP_TIMEOUT
  _channel_num = 0;
  _timeout = 100; // ms
  _status = eADC_NOTSETUP; // -1
  _mode = eADC_POLLING; // 0       (_mode & 0x7)
}

//#include <stm32f4xx_hal.h>

stm32adc::stm32adc(ADC_TypeDef *adc, struct adc_channels *ac) {
  if(adc == ADC1) {
    _ha = &hadc1;
  } else {
  //if(adc == ADC2) {
    return;
    //_ha = &hadc2;
  }
  _channel_num = 0;
  _timeout = 100; // ms
  _status = eADC_NOTSETUP; // -1
  _mode = eADC_POLLING; // 0       (_mode & 0x7)

//  setup(adc, ac);
}

void stm32adc::setup(ADC_TypeDef *adc, struct adc_channels *ac) {
  _status = -1;
  if(adc == ADC1) {
    _ha = &hadc1;
  } else {
  //if(adc == ADC2) {
    return;
    //_ha = &hadc2;
  }
  HUL_ADC_clk_enable(_ha->Instance);

  _ha->Instance = adc;
  _channel_num = 0;
  _timeout = 1; // ms
  _status = 0;
 
  int chs = 0;
  for(; (ac+chs)->ch != -1 ; chs++);
  
  _ha->Init.ExternalTrigConv = ADC_SOFTWARE_START;
  _ha->Init.DataAlign = ADC_DATAALIGN_RIGHT;
  _ha->Init.NbrOfConversion = chs;                   // <> _channel_num
  _ha->Init.DiscontinuousConvMode = DISABLE;
  _ha->Init.ScanConvMode = ENABLE; //DISABLE; // ENABLE
  _ha->Init.ContinuousConvMode = DISABLE;

  HUL_ADC_clk_enable(adc);

